My_Notebook.org
#+title:shadow-fish‘s Notebook
#+author: CYQ
#+data:<2021-11-03 Wed>
#+LANGUAGE: zh-CN
#+html_head: <link rel="stylesheet" type="text/css" href="./css/worg-classic .css"/>
#+options: num:t toc:4 author:t date:t
* linux相关
** linux相关
- [[./note/linux就是这个范儿.org][linux就是这个范儿]]
- [[./note/linux鸟哥私房菜.org][linux鸟哥私房菜]]
- [[./note/linux就该这么学.org][linux就该这么学]]
- [[./note/manjaro.org][Manjaro Linux日常记录]]
** emacs相关
- [[file:Org-mode高效整理笔记指南（AI整理）.org][Org-mode高效整理笔记指南（AI整理）]]
- [[file:note/Emacs dired使用指南.org][Emacs Dired使用指南]]
- [[file:note/emacs笔记.org][emacs笔记]]
- [[file:note/use-package.org][use-package详细说明]]
- [[file:note/Emacs自力求生指南——前言.org][Emacs自力求生指南——前言.org]]
- [[file:note/Emacs自力求生指南.org][Emacs自力求生指南——自己写配置.org]]
- [[./note/emacs完全补完计划.org][emacs完全补完计划]]
- [[file:note/emacs-101.org][Emacs-101]]
- [[./note/《学习emacs》笔记.org][《学习emacs》笔记]]
- [[./note/emacs学习笔记.org][emacs学习笔记]]
- [[./note/emacs插件.org][emacs插件]]
- [[./note/emacs平时记录.org][emacs平时记录]]
- [[./note/org-mode.org][org-mode笔记]]
- [[./note/spacemacs使用.org][Spacemacs使用小结]]
- [[./note/spacemacs官方教程.org][spacemacs官方教程]]
- [[./note/从零开始——Emacs安装配置使用教程.org][从零开始——Emacs安装配置使用教程]]
- [[./note/Emacs Lisp简明教程.org][Emacs Lisp简明教程.org]]
- [[./note/EMACS中文教程.org][EMACS中文教程.org]]
- [[./note/emacs学习笔记整理.org][21天学会EMACS]]
- [[./note/emacs文档中文化.org][emacs文档中文化]]
- [[./note/Emacs-最好的Python编辑器.org][Emacs-最好y的Python编辑器]]
- [[./note/Master Emacs in 21 Days.org][Master Emacs in 21 Days]]
- [[./note/Master Emacs in 21 Days(2022).org][Mater Emacs in 21 Days(2022)]]
- [[./note/org导出设置.org][org导出设置]]
- [[./note/王垠的Emacs简单设置.org][王垠的Emacs的简单设置]]
- [[./note/Spacemacs Rocks Episode2.org][子龙山人emacs 21天视频教程笔记]]
- [[./note/Emacs Fill详解.org][Emacs Fill详解]]
- [[./note/Emacs绑定键盘的技巧.org][Emacs绑定键盘的技巧]]
- [[./note/elisp.org][elisp笔记]]
- [[./note/emacs-cookbook.org][emacs-cookbook.org]]
- [[./note/writing php with emacs.org][Writing PHP with Emacs]]
** vi相关
- [[./note/vi教程.org][vi教程]]
* 虚拟化技术
** 容器相关
- [[file:容器的概念和使用.org][容器的概念和使用]]
* Web开发
** html相关
     -[[./note/Html & CSS 设计与构建网站.org][ Html & CSS 设计与构建网站]]
     - [[./note/HTML5教程.org][HTML5教程]]
     - [[./note/《精通HTML5+CSS3+JavaScript网页设计》.org][精通HTML5+CSS3+JavaScript网页设计]]
     - [[./note/JavaScript和jQuery.org][JavaScript和jQrery 交互式web前端开发]]
     - [[./note/web前端开发.org][web前端开发]]
     - [[./note/html5实战宝典.org][HTML5实战宝典]]

** Web 前端框架
*** laminas （前身为 Zend framework）文档
** Php相关
     - [[./note/PHP和MySQL Web开发.org][PHP和MySQl Web开发]]
     - [[./note/精通PHP+MySQL应用开发.org][精通PHP+MySQL应用开发]]
     - [[./note/《php开发实战权威指南》.org][php开发实战权威指南]]
     - [[./note/兄弟连php教程笔记.org][兄弟连php教程笔记]]
     - [[./note/mac下配置php开发环境.org][mac下配置php开发环境]]
     - [[./note/李炎烣PHP教程第一季.org][李炎烣PHP教程第一季]]
     - [[./note/PHP Web 2.0开发实战.org][PHP Web 2.0开发实战.org]]
     - [[./note/PHP+MySQL+AJAX Web 给力起飞.org][PHP+MySQL+AJAX Web 给力起飞.org]]
     - [[./note/php菜鸟教程.org][PHP菜鸟教程]]
     - [[./note/phpspreadsheet读取excl.org][phpspreadsheet读取excel]]
** 数据库
- [[./note/mysql菜鸟教程.org][mysql菜鸟教程]]
- [[file:MySQL使用指南.org][MySQL使用指南]]

* photosho相关
    - [[./note/人像后期调色圣经.org][人像后期调色圣经]]
    - [[./note/Photoshop CS5 摄影师专业技法.org][Photoshop CS5 摄影师专业技法]]
* 程序设计
** C++
    - [[./note/《c++程序设计》自学考试.org][C++程序设计——自学考试]]
    - [[./note/C++大学教程.org][C++大学教程.org]]
** Python
    - [[./note/Python从小白到大牛.org][Python从小白到大牛]]
    - [[./note/python基础教程（第三版）.org][python基础教程(第三版)]]
    - [[./note/python编程快速上手.org][python编程快速上手]]
* github相关
    - [[./note/github笔记.org][github笔记]]
* 平时随笔
    - [[./note/日常记录2021-4.org][日常记录]]

