My_Notebook.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-03 Wed 19:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>shadow-fish‘s Notebook</title>
<meta name="author" content="ShadowFish" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">shadow-fish‘s Notebook</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf3a3073">1. linux相关</a>
<ul>
<li><a href="#org55d38bc">1.1. linux相关</a></li>
<li><a href="#orgb467604">1.2. emacs相关</a></li>
<li><a href="#orgd96d4b7">1.3. vi相关</a></li>
</ul>
</li>
<li><a href="#orgf119299">2. Web开发</a>
<ul>
<li><a href="#orgaa9fff3">2.1. html相关</a></li>
<li><a href="#orgbb98fdc">2.2. Web 前端框架</a>
<ul>
<li><a href="#orgb5a6925">2.2.1. laminas （前身为 Zend framework）文档</a></li>
</ul>
</li>
<li><a href="#org4441cd4">2.3. Php相关</a></li>
<li><a href="#orgd942fec">2.4. 数据库</a></li>
</ul>
</li>
<li><a href="#orga2edac0">3. photosho相关</a></li>
<li><a href="#org51b8ad6">4. 程序设计</a>
<ul>
<li><a href="#org6c16527">4.1. C++</a></li>
<li><a href="#org028176d">4.2. Python</a></li>
</ul>
</li>
<li><a href="#org9e92031">5. github相关</a></li>
<li><a href="#org0e5a289">6. 平时随笔</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf3a3073" class="outline-2">
<h2 id="orgf3a3073"><span class="section-number-2">1.</span> linux相关</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org55d38bc" class="outline-3">
<h3 id="org55d38bc"><span class="section-number-3">1.1.</span> linux相关</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="./note/linux就是这个范儿.html">linux就是这个范儿</a></li>
<li><a href="./note/linux鸟哥私房菜.html">linux鸟哥私房菜</a></li>
<li><a href="./note/linux就该这么学.html">linux就该这么学</a></li>
<li><a href="./note/manjaro.html">Manjaro Linux日常记录</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgb467604" class="outline-3">
<h3 id="orgb467604"><span class="section-number-3">1.2.</span> emacs相关</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="note/Emacs自力求生指南——前言.html">Emacs自力求生指南——前言.org</a></li>
<li><a href="note/Emacs自力求生指南.html">Emacs自力求生指南——自己写配置.org</a></li>
<li><a href="./note/emacs完全补完计划.html">emacs完全补完计划</a></li>
<li><a href="./note/《学习emacs》笔记.html">《学习emacs》笔记</a></li>
<li><a href="./note/emacs学习笔记.html">emacs学习笔记</a></li>
<li><a href="./note/emacs插件.html">emacs插件</a></li>
<li><a href="./note/emacs平时记录.html">emacs平时记录</a></li>
<li><a href="./note/org-mode.html">org-mode笔记</a></li>
<li><a href="./note/spacemacs使用.html">Spacemacs使用小结</a></li>
<li><a href="./note/spacemacs官方教程.html">spacemacs官方教程</a></li>
<li><a href="./note/从零开始——Emacs安装配置使用教程.html">从零开始——Emacs安装配置使用教程</a></li>
<li><a href="./note/Emacs Lisp简明教程.html">Emacs Lisp简明教程.org</a></li>
<li><a href="./note/EMACS中文教程.html">EMACS中文教程.org</a></li>
<li><a href="./note/emacs学习笔记整理.html">21天学会EMACS</a></li>
<li><a href="./note/emacs文档中文化.html">emacs文档中文化</a></li>
<li><a href="./note/Emacs-最好的Python编辑器.html">Emacs-最好y的Python编辑器</a></li>
<li><a href="./note/Master Emacs in 21 Days.html">Master Emacs in 21 Days</a></li>
<li><a href="./note/Master Emacs in 21 Days(2022).html">Mater Emacs in 21 Days(2022)</a></li>
<li><a href="./note/org导出设置.html">org导出设置</a></li>
<li><a href="./note/%E7%8E%8B%E5%9E%A0%E7%9A%84Emacs%E7%AE%80%E5%8D%95%E8%AE%BE%E7%BD%AE.html">王垠的Emacs的简单设置</a></li>
<li><a href="./note/Spacemacs Rocks Episode2.html">子龙山人emacs 21天视频教程笔记</a></li>
<li><a href="./note/Emacs Fill详解.html">Emacs Fill详解</a></li>
<li><a href="./note/Emacs绑定键盘的技巧.html">Emacs绑定键盘的技巧</a></li>
<li><a href="./note/elisp.html">elisp笔记</a></li>
<li><a href="./note/emacs-cookbook.html">emacs-cookbook.org</a></li>
<li><a href="./note/writing php with emacs.html">Writing PHP with Emacs</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd96d4b7" class="outline-3">
<h3 id="orgd96d4b7"><span class="section-number-3">1.3.</span> vi相关</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><a href="./note/vi教程.html">vi教程</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf119299" class="outline-2">
<h2 id="orgf119299"><span class="section-number-2">2.</span> Web开发</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgaa9fff3" class="outline-3">
<h3 id="orgaa9fff3"><span class="section-number-3">2.1.</span> html相关</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><a href="./note/Html &amp; CSS 设计与构建网站.html"> Html &amp; CSS 设计与构建网站</a></li>
<li><a href="./note/HTML5教程.html">HTML5教程</a></li>
<li><a href="./note/《精通HTML5+CSS3+JavaScript网页设计》.html">精通HTML5+CSS3+JavaScript网页设计</a></li>
<li><a href="./note/JavaScript和jQuery.html">JavaScript和jQrery 交互式web前端开发</a></li>
<li><a href="./note/web前端开发.html">web前端开发</a></li>
<li><a href="./note/html5实战宝典.html">HTML5实战宝典</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbb98fdc" class="outline-3">
<h3 id="orgbb98fdc"><span class="section-number-3">2.2.</span> Web 前端框架</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgb5a6925" class="outline-4">
<h4 id="orgb5a6925"><span class="section-number-4">2.2.1.</span> laminas （前身为 Zend framework）文档</h4>
</div>
</div>
<div id="outline-container-org4441cd4" class="outline-3">
<h3 id="org4441cd4"><span class="section-number-3">2.3.</span> Php相关</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><a href="./note/PHP和MySQL Web开发.html">PHP和MySQl Web开发</a></li>
<li><a href="./note/精通PHP+MySQL应用开发.html">精通PHP+MySQL应用开发</a></li>
<li><a href="./note/《php开发实战权威指南》.html">php开发实战权威指南</a></li>
<li><a href="./note/兄弟连php教程笔记.html">兄弟连php教程笔记</a></li>
<li><a href="./note/mac下配置php开发环境.html">mac下配置php开发环境</a></li>
<li><a href="./note/李炎烣PHP教程第一季.html">李炎烣PHP教程第一季</a></li>
<li><a href="./note/PHP Web 2.0开发实战.html">PHP Web 2.0开发实战.org</a></li>
<li><a href="./note/PHP+MySQL+AJAX Web 给力起飞.html">PHP+MySQL+AJAX Web 给力起飞.org</a></li>
<li><a href="./note/php菜鸟教程.html">PHP菜鸟教程</a></li>
<li><a href="./note/phpspreadsheet读取excl.html">phpspreadsheet读取excel</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd942fec" class="outline-3">
<h3 id="orgd942fec"><span class="section-number-3">2.4.</span> 数据库</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li><a href="./note/mysql菜鸟教程.html">mysql菜鸟教程</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga2edac0" class="outline-2">
<h2 id="orga2edac0"><span class="section-number-2">3.</span> photosho相关</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="./note/人像后期调色圣经.html">人像后期调色圣经</a></li>
<li><a href="./note/Photoshop CS5 摄影师专业技法.html">Photoshop CS5 摄影师专业技法</a></li>
</ul>
</div>
</div>
<div id="outline-container-org51b8ad6" class="outline-2">
<h2 id="org51b8ad6"><span class="section-number-2">4.</span> 程序设计</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org6c16527" class="outline-3">
<h3 id="org6c16527"><span class="section-number-3">4.1.</span> C++</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li><a href="./note/《c++程序设计》自学考试.html">C++程序设计——自学考试</a></li>
<li><a href="./note/C++大学教程.html">C++大学教程.org</a></li>
</ul>
</div>
</div>
<div id="outline-container-org028176d" class="outline-3">
<h3 id="org028176d"><span class="section-number-3">4.2.</span> Python</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li><a href="./note/Python从小白到大牛.html">Python从小白到大牛</a></li>
<li><a href="./note/python基础教程（第三版）.html">python基础教程(第三版)</a></li>
<li><a href="./note/python%E7%BC%96%E7%A8%8B%E5%BF%AB%E9%80%9F%E4%B8%8A%E6%89%8B.html">python编程快速上手</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9e92031" class="outline-2">
<h2 id="org9e92031"><span class="section-number-2">5.</span> github相关</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="./note/github笔记.html">github笔记</a></li>
</ul>
</div>
</div>
<div id="outline-container-org0e5a289" class="outline-2">
<h2 id="org0e5a289"><span class="section-number-2">6.</span> 平时随笔</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><a href="./note/日常记录2021-4.html">日常记录</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: ShadowFish</p>
<p class="date">Created: 2025-09-03 Wed 19:19</p>
</div>
</body>
</html>
